app/views/Application/notifytemplate.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
	<soapenv:Header />
	<soapenv:Body>
		<b:Notify xmlns:b="http://docs.oasis-open.org/wsn/b-2"
			xmlns:add="http://www.w3.org/2005/08/addressing">
			<b:NotificationMessage>
				<b:SubscriptionReference>
					<add:Address>${subscriber}</add:Address>
				</b:SubscriptionReference>
				<b:Topic Dialect="http://www.w3.org/TR/1999/REC-xpath-19991116" xmlns:${topicPrefix}="${topicURL}">${topicPrefix}:${topicName}</b:Topic>
				<!-- 
				<b:ProducerReference>
					<add:Address>http://localhost:8084/petals/services/NotificationProducerPortService</add:Address>
				</b:ProducerReference>
				-->
				<b:Message>
					<foo>${content}</foo>
				</b:Message>
			</b:NotificationMessage>
		</b:Notify>
	</soapenv:Body>
</soapenv:Envelope>

